//
//  main.c
//  project1
//
//  Created by 박지현 on 2023/11/09.
//

#include <stdio.h>

int main(void) {
    printf("안녕하세요. 이것은 길 글 연습 프로젝트입니다.\n");
    printf("당신은 C언어를 처음 해도 걱정할 필요 없습니다.\n");
    printf("C언어를 공부하는데 가장 좋은 방법은 복습과 직접 실습하는 것입니다.\n");
    printf("그러므로 복습하고 직접 실습을 한다면 금방 실력이 상승할 것입니다.\n");
    printf("\'꼭\'! 복습을 하세요.");
    printf("C언어의 문법은 좀 어렵지만 그래도 C언어를 배우면 다른 언어는 쉽게 느껴져요.\n\n");
    printf("C언어의 장점은 또 뭐가 있을까요?\n");
    printf("제가 생각하기엔 C언어의 장점은 많습니다.\n");
    printf("다양한 분야에서 \'활용\'할 수 있습니다.\n\n");
    printf("또한, C언어와 파이썬은 결합이 가능합니다.\n정말 놀랍네요.\n\n");
    printf("마지막으로 문제를 많이 풀어야 됩니다.\n");
    printf("개념은 누구나 이해하지만 개념에서 끝내면 \"절대\"!! 안 됩니다.\n");
    printf("항상 개념을 공부한 뒤 꼭 다양한 문제를 \'많이\' 풀어야 됩니다.\n\n");
    printf("그럼 이제 그만하도록 하겠습니다.\n");
    printf("안녕!\n");
    
    return 0;
}

